Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: ཆོས་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་རྗེས་སུ་སོང་བར་མཐོང་བ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ལ་མཁས་པ་སྟེ། ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ།
en: In fact, this vision that all things follow awakening is the bodhisattva’s mastery of skill in means.

source: དཔེར་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ས་ལས་སྐྱེ་བ་ནི་སྐྱེ་བ་ཇི་ལྟ་བར་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཡོངས་སུ་སྤྱད་པར་མི་འགྱུར་བ་གང་ཡང་མེད་དོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་སྤྱད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱིར་ཕན་འདོགས་པར་མི་མཐོང་བའི་དམིགས་པ་གང་ཡང་མེད་དོ། །
en: Śāntamati, just as there is nothing that grows out of the ground throughout the cosmos of a billion worlds that is not put to use by the beings who are likewise born here for their growth, in the very same way, Śāntamati, there are no cognitive bases that bodhisattvas do not perceive as a benefit for awakening and are not put to use for awakening by those bodhisattvas who have mastered skill in means.

source: ཞི་བའི་བློ་གྲོས་འདི་ལྟ་སྟེ། དཔེར་ན་གཟུགས་གང་ཅི་ཡང་རུང་སྟེ་དེ་ཐམས་ཅད་ནི་འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པའོ། །ཞི་བའི་བློ་གྲོས་དེ་བཞིན་དུ་ཐབས་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དམིགས་པ་གང་ཅི་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ནི་བྱང་ཆུབ་ཀྱི་རྣམ་པ་དང་ཡང་དག་པར་ལྡན་པའོ། །
en: Śāntamati, just as each and every material form is made from the four great elements, in the very same way, Śāntamati, for the bodhisattva who has mastered skill in means, each and every object of cognition possesses the nature and shape of awakening.

source: ཞི་བའི་བློ་གྲོས་སེམས་ཅན་གང་དག་འཇུངས་པ་དང་། བྱས་པ་མི་གཟོ་བ་དེ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: “Those beings who are stingy and have no gratitude, Śāntamati, enable bodhisattvas to achieve the perfection of generosity and the perfection of moral conduct to their full extent.

source: སེམས་ཅན་གང་དག་ཁྲོ་བ་ལ་སྤྱོད་པ་དང་། །ལེ་ལོ་ཅན་དེ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: Those beings who are lazy and commit acts out of anger enable bodhisattvas to achieve the perfection of heroic effort and the perfection of patience to their full extent.

source: སེམས་ཅན་གང་དག་གླེན་པ་དང་། རྨོངས་པ་དེ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: Those beings who are thickheaded and ignorant enable bodhisattvas to achieve the perfection of concentration and the perfection of wisdom to their full extent.

source: སེམས་ཅན་གང་དག་ཕན་མི་འདོགས་པ་དེ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའ་ཁོང་ཁྲོ་བའི་སེམས་སུ་མི་འགྱུར་རོ། །
en: “When other beings do not return a favor, bodhisattvas do not become angry.

source: སེམས་ཅན་གང་དག་ཕན་འདོགས་པ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྗེས་སུ་ཆགས་པའི་སེམས་སུ་མི་འགྱུར་རོ། །
en: Bodhisattvas do not become attached when other beings do reciprocate.

source: སེམས་ཅན་གང་དག་བསྔགས་པ་རྗོད་པ་དེ་དག་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཁེངས་པར་མི་འགྱུར་རོ། །
en: Bodhisattvas do not become full of themselves even when other beings offer them praise.

source: སེམས་ཅན་གང་དག་བསྔགས་པ་མི་རྗོད་པ་དེ་དག་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྲོ་ཤི་བར་མི་འགྱུར་རོ། །
en: At the same time, bodhisattvas do not become discouraged when other beings do not praise them.

source: སེམས་ཅན་གང་དག་སྡུག་བསྔལ་བ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ། །
en: Bodhisattvas feel great compassion at the suffering of other beings.

source: སེམས་ཅན་གང་དག་བདེ་བ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་དགའ་བ་དང་མཆོག་ཏུ་དགའ་བ་སྐྱེའོ། །
en: Bodhisattvas feel joy and ecstasy at the happiness of other beings.

source: སེམས་ཅན་གང་དག་གདུལ་དཀའ་བ་དང་། དམུ་རྒོད་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཞི་གནས་ཀྱི་སེམས་སྐྱེའོ། །
en: Bodhisattvas cultivate calm abiding for those beings who are unruly and difficult to tame.

source: སེམས་ཅན་གང་དག་ཅང་ཤེས་པ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱས་པ་གཟོ་བའི་བློ་སྐྱེའོ། །
en: Bodhisattvas generate thoughts of gratitude for those beings who are well bred.

source: སེམས་ཅན་གང་དག་རྐྱེན་གྱི་སྟོབས་ཅན་ཡིན་པ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྗེས་སུ་སྲུང་བའི་བློ་སྐྱེའོ། །
en: Bodhisattvas generate thoughts of protection for those at the mercy of circumstances beyond their control.

source: སེམས་ཅན་གང་དག་རྒྱུའི་སྟོབས་ཅན་ཡིན་པ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆད་པས་གཅད་པ་དང་།
en: For those who have the power to affect their circumstances, however, bodhisattvas generate thoughts of advice, admonishment, and even punishment.

source: བསྡིགས་པ་དང་། གདམས་པའི་བློ་སྐྱེའོ། །སེམས་ཅན་གང་དག་ཟུར་ཙམ་གྱིས་གོ་བ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔས་ཟབ་མོའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: “Bodhisattvas will deliver profound teachings to those who can gain an understanding from a highly condensed statement.

source: སེམས་ཅན་གང་དག་རྣམ་པར་སྤྲོས་པས་གོ་བ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔས་གཏམ་རྒྱས་པར་བརྗོད་པར་བྱའོ། །
en: Bodhisattvas will deliver extensive teachings to those who can gain an understanding from a full, detailed explanation.

source: སེམས་ཅན་གང་དག་བཀྲི་དགོས་པ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔས་གཏམ་གོ་རིམས་སུ་ཕབ་སྟེ་བརྗོད་པར་བྱའོ། །
en: Bodhisattvas will give teachings that follow a progression to those who have a need for step-by-step guidance.

source: སེམས་ཅན་གང་དག་ཚིག་ལྷུར་ལེན་པ་དེ་དག་ལ་ཚིག་དང་ཡི་གེ་བསྙུངས་ཏེ་གཏམ་བརྗོད་པར་བྱའོ། །
en: Bodhisattvas will give teachings of a few syllables or a word to those who able to discern the meaning.

source: གང་དག་ཞི་གནས་སྔོན་དུ་འགྲོ་བ་དེ་དག་ལ་ལྷག་མཐོང་གི་གཏམ་བརྗོད་པར་བྱའོ། །
en: “Bodhisattvas will give teachings on deep insight to those who have done the preliminary practice of calm abiding.

source: གང་དག་ལྷག་མཐོང་སྔོན་དུ་འགྲོ་བ་དེ་དག་ལ་ཏིང་ངེ་འཛིན་ལ་འདུག་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: Bodhisattvas will give teachings on settling into meditative concentration for those who have done the preliminary practice of deep insight.

source: གང་དག་ཚུལ་ཁྲིམས་ལ་ཆགས་པ་དེ་དག་ལ་མཐར་ཕྱིན་པ་མ་ཡིན་པས་ཡང་སེམས་ཅན་དམྱལ་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: “To those who are attached to moral conduct, bodhisattvas will give teachings on the hell realms even though they are not their certain destination.

source: སེམས་ཅན་གང་དག་ཐོས་པ་ལ་ཆགས་པ་དེ་དག་ལ་འབྱུང་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who are attached to learning, bodhisattvas will give teachings on freedom.

source: སེམས་ཅན་གང་དག་ཏིང་ངེ་འཛིན་ལ་ཆགས་པ་དེ་དག་ལ་ཤེས་རབ་ལ་འཇུག་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who are attached to meditative concentration, bodhisattvas will give teachings on using discernment.

source: སེམས་ཅན་གང་དག་དགོན་པའི་གནས་ལ་ཆགས་པ་དེ་དག་ལ་སེམས་དབེན་པར་བྱ་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who are attached to living in the forest, bodhisattvas will give teachings that the mind is what should be brought into a state of solitude.

source: གང་དག་སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པ་ལ་ཆགས་པ་དེ་དག་ལ་འཕགས་པའི་ཤེས་རབ་ཀྱི་དབང་པོའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who are attached to severe asceticism and the ascetic virtues of the pure ones, bodhisattvas will give teachings on the spiritual faculty of wisdom possessed by the noble ones.

source: གང་དག་གཏི་མུག་ཆེ་བ་དེ་དག་ལ་ཐོས་པས་སྣང་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those whose ignorance is great, bodhisattvas will give teachings on what becomes apparent through learning.

source: གང་དག་འདོད་ཆགས་ཀྱིས་ནོན་པ་དེ་དག་ལ་མི་སྡུག་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: “To those who are oppressed by sensual desire, bodhisattvas will give teachings on what is repulsive.

source: གང་དག་ཞེ་སྡང་གིས་ནོན་པ་དེ་དག་ལ་བྱམས་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who are oppressed by hatred, bodhisattvas will give teachings on love.

source: གང་དག་གཏི་མུག་གིས་ནོན་པ་དེ་དག་ལ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who are oppressed by ignorance, bodhisattvas will give teachings on dependent arising.

source: སེམས་ཅན་གང་དག་ཆ་མཉམ་པ་ལ་སྤྱོད་པ་དེ་དག་ལ་སྐབས་སྐབས་སུ་གཏམ་རྒྱས་པར་བརྗོད་པར་བྱ་སྟེ། འདི་ལྟ་སྟེ། མི་སྡུག་པའི་གཏམ་དང་། བྱམས་པའི་གཏམ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who carry out acts of passion, hatred, and ignorance in equal measure, bodhisattvas will give more expansive teachings in such a way that sometimes they will give teachings on what is repulsive, at other times they will give teachings on love, and at other times they will give teachings on dependent arising.

source: སེམས་ཅན་གང་དག་རྗེས་སུ་འཐུན་པའི་གཏམ་གྱིས་འདུལ་བ་དེ་དག་ལ་ལྷག་པའི་ཚུལ་ཁྲིམས་ཀྱི་གཏམ་བརྗོད་པར་བྱ། ལྷག་པའི་སེམས་ཀྱི་གཏམ་བརྗོད་པར་བྱ། ལྷག་པའི་ཤེས་རབ་ཀྱི་གཏམ་བརྗོད་པར་བྱའོ། །
en: “Bodhisattvas will give teachings on superior forms of moral conduct, superior forms of intellect, and superior forms of discernment to those who need to be trained by teachings of a suitable nature.

source: གང་དག་སངས་རྒྱས་ཀྱིས་འདུལ་བ་དེ་དག་ལ་བདེན་པའི་གཏམ་གྱི་རྗེས་སུ་འཐུན་པ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who need to be trained by a buddha, they will give suitable teachings on the truths and suitable teachings on the constitutive factors of awakening.

source: སེམས་ཅན་གང་དག་སྨ་དབབ་པས་འདུལ་བ་དེ་དག་ལ་གདོང་བསྒྱུར་ཏེ་ཕྱིས་ཆོས་ཀྱི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who need to be trained by censure, they will teach the Dharma after turning away their faces.

source: གང་དག་རྒྱུན་མི་འཆད་པར་བསྟན་པས་འདུལ་བ་དེ་དག་ལ་རྟག་པར་རྒྱུན་དུ་བརྟན་པ་བསྟན་པར་བྱའོ། །
en: They will teach steadily and continuously to those who need to be trained by an unbroken stream of discourse.

source: དབང་པོ་ཡོངས་སུ་མ་སྨིན་པ་རྣམས་ལ་ནི་ཆོས་ཀྱི་གཏམ་བརྗོད་པར་བྱའོ། །
en: They will give teachings on the Dharma to those whose spiritual faculties are not yet mature.

source: གང་དག་སྣ་ཚོགས་ཀྱི་གཏམ་གྱིས་འདུལ་བ་དེ་དག་ལ་རྟོགས་པ་བརྗོད་པ་གཏན་ལ་དབབ་པ་བསྟན་པ་དང་། དཔེ་དགོད་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: “To those who need to be trained by diverse kinds of teachings, bodhisattvas will give teachings that contain parables, doctrinal exegesis, and avadānas.

source: སེམས་ཅན་གང་དག་ཟབ་མོའི་གཏམ་གྱིས་འདུལ་བ་དེ་དག་ལ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་གཏམ་དང་། སེམས་ཅན་མེད་པའི་གཏམ་དང་། གང་ཟག་མེད་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who need to be guided by profound teachings, they will give teachings on dependent arising, teachings on the nonexistence of a sentient being, and teachings on the nonexistence of a person.

source: ལྟ་བར་བྱིང་བ་རྣམས་ལ་སྟོང་པ་ཉིད་ཀྱི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who are mired in views, they will give teachings on emptiness.

source: རྣམ་པར་རྟོག་པ་ལ་སྤྱོད་པ་རྣམས་ལ་མཚན་མ་མེད་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who engage in rumination, they will give teachings on what is groundless.

source: སེམས་ཅན་སྨོན་ལམ་ལ་སྤྱོད་པ་རྣམས་ལ་སྨོན་པ་མེད་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who make aspirations, they will give teachings on what is free from longing.

source: ཕུང་པོ་ལ་གནས་པ་རྣམས་ལ་སྒྱུ་མའི་ཆོས་ཀྱི་གཏམ་བརྗོད་པར་བྱའོ། །
en: “To those who put stock in the aggregates, bodhisattvas will give teachings on the illusory nature of things.

source: ཁམས་ལ་གནས་པ་རྣམས་ལ་རབ་ཏུ་དབེན་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who put stock in the elements, they will give teachings on total isolation.

source: སྐྱེ་མཆེད་ལ་གནས་པ་རྣམས་ལ་རྨི་ལམ་ལྟ་བུའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who put stock in the sense spheres, they will give the teaching that things are like a dream.

source: འདོད་པའི་ཁམས་ལ་གནས་པ་རྣམས་ལ་ཀུན་ཏུ་འབར་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: “To those who dwell in the desire realm, bodhisattvas will give the teaching that everything is on fire.

source: གཟུགས་ཀྱི་ཁམས་ལ་གནས་པ་རྣམས་ལ་འདུ་བྱེད་ཐམས་ཅད་སྡུག་བསྔལ་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who dwell in the form realm, they will give the teaching that all conditioned things involve suffering.

source: གཟུགས་མེད་པའི་ཁམས་ལ་གནས་པ་རྣམས་ལ་འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who live in the formless realm, they will give the teaching that all conditioned things are impermanent.

source: སྡུག་བསྔལ་གྱིས་འདུལ་བ་རྣམས་ལ་འཕགས་པའི་རིགས་ཆོག་ཤེས་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: “To those who need to be trained by teachings about suffering, bodhisattvas will give teachings on the contentment of the lineage of the noble ones.

source: བདེ་བས་འདུལ་བ་རྣམས་ལ་བསམ་གཏན་དང་ཚད་མེད་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who need to be trained by teachings about bliss, they will give teachings on the four states of meditative concentration and the four immeasurable states.

source: ལྷས་འདུལ་བ་རྣམས་ལ་གཅིག་ཏུ་བདེ་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who need to be trained by teachings about the gods, they will give teachings on experiencing nothing but bliss.

source: མཚན་མས་འདུལ་བ་རྣམས་ལ་ངའི་བ་མེད་པ་དང་ཡོངས་སུ་འཛིན་པ་མེད་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who need to be trained by teachings on distinguishing characteristics, they will give teachings on not grasping on to things and making them ‘mine.’

source: ཉན་ཐོས་ཀྱིས་འདུལ་བ་རྣམས་ལ་རྗེས་སུ་བསྟན་པ་དང་དེའི་བྱ་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: “To those who need to be trained as disciples, bodhisattvas will give teachings on the instructions and appropriate practices for them.

source: རང་སངས་རྒྱས་ཀྱིས་འདུལ་བ་རྣམས་ལ་དོན་ཉུང་བ་དང་བྱ་བ་ཉུང་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To those who need to be trained as solitary buddhas, they will give teachings on little actions and little benefits.

source: སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ལྷག་པའི་བསམ་པ་དང་སྙིང་རྗེ་ཆེན་པོའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To bodhisattvas who are conceiving the aspiration for awakening for the first time, they will give teachings on ambition and great compassion.

source: སྤྱོད་པ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་འཁོར་བས་ཡོངས་སུ་མི་སྐྱོ་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To bodhisattvas who have been undertaking the conduct of a bodhisattva for some time, they will give teachings on not becoming wearied by the realm of rebirth.

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱང་བའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To bodhisattvas who have reached the stage of being impossible to turn back from awakening, they will give teachings on the purification of a buddha domain.

source: སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱན་གྱི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To bodhisattvas who have one more life, they will give teachings on adorning the seat of awakening.

source: སེམས་ཅན་གང་དག་སངས་རྒྱས་ཀྱིས་འདུལ་བ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔས་མ་ཚང་བ་མེད་པ་དང་། འབྲས་བུ་ཡོད་པའི་གཏམ་བརྗོད་པར་བྱའོ། །
en: To all those who have the potential to be trained by the buddhas, they will give teachings on what is fruitful and without deficiency.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་དང་། ཤེས་རབ་ཡོངས་སུ་དག་ཅིང་དམིགས་པ་ལ་དབང་ཐོབ་པ་ནི་འབྲས་བུ་ཡོད་པའི་ཆོས་སྟོན་པ་ཡིན།
en: “In short, Śāntamati, bodhisattvas who have purified their wisdom and their skill in means and who have gained mastery over the bases of cognition teach the Dharma that is fruitful.

source: ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པ་ཡིན་ནོ། །
en: They satisfy all beings with their well-spoken words.”

source: བསྟན་པ་འདི་བཤད་པ་ན་སྲོག་ཆགས་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ། །
en: When this teaching was given, ten thousand beings conceived the aspiration for unsurpassable and perfect awakening, and five hundred bodhisattvas attained an acceptance of the fact that things do not arise.

source: དམིགས་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅོ་ལྔ་པའོ།། །།
en: This was the fifteenth chapter, “The Bases of Cognition.” Chapter 16: The Prediction for Vajrapāṇi, Lord of the Guhyakas

source: དེ་ནས་འཁོར་དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་འདི་སྙམ་དུ་སེམས་ཏེ། ཀྱེ་མ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་འདི་ཇི་སྲིད་ཅིག་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར།
en: At that point, some the bodhisattvas in the assembly had the thought, “When will Vajrapāṇi, Lord of the Guhyakas, awaken to unsurpassable and perfect awakening and become a perfect buddha?

source: དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ནི་མིང་ཅི་ཞེས་བྱ་བར་འགྱུར།
en: What will his buddha realm be called?

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་མིང་ནི་ཅི་ཞེས་བྱ་བར་འགྱུར།
en: What will be his name when he attains awakening?

source: དེའི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ནི་ཅི་འདྲ་བ་ཞིག་ཏུ་འགྱུར་སྙམ་མོ། །
en: What will his assembly of bodhisattvas be like?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །
en: Then, knowing with his mind the train of thought in the minds of those bodhisattvas at that moment, the Blessed One smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་གང་གི་ཚེ་འཛུམ་པ་མཛད་པ་དེའི་ཚེ། འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་འབྱུང་བས། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་དུ་མ་དང་ལྡན་པ་ཁ་དོག་ཐ་དད་པ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེབ་རྒན་དང་།
en: When blessed buddhas smile, it is the nature of things that multicolored rays of light issue from the blessed one’s mouth.

source: ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་བྱུང་ནས་འོད་དེས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་ཁྱབ་པར་བྱས་ཏེ། ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་འཕགས་ནས་སླར་ལོག་སྟེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་པར་གྱུར་ཏོ། །
en: So, at that moment variegated, multicolored rays of blue, yellow, red, white, rose madder, brilliant, and shiny light issued forth and spread throughout limitless worlds, reaching upward as far as the Brahmā worlds, before they came back down and, after circling the Blessed One three times, they disappeared into the top of his head.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ཀྱིས་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འཛུམ་པ་མཛད་པའི་དོན་ཞུས་པ།
en: The bodhisattva of great courage, Śāntamati, then asked the Blessed One about the meaning of his smile by speaking the following verses:

source: འོད་བཟང་དྲི་མ་མི་མངའ་གསེར་དང་འདྲ། །ཟླ་བའི་ཞལ་འདྲ་ཞི་གནས་ལེགས་པར་བཞུགས། །
en: “Resting in equipoise, like the face of the moon, Your beautiful light, like the purest gold,

source: ཉི་མ་ལྟ་བུ་མུན་པ་འཇོམས་མཛད་པ། །
en: Dispels the darkness like the sun—

source: མི་མཆོག་ཅི་ཡི་སླད་དུ་འཛུམ་པ་བསྟན། །
en: For what reason, Best of Men, do you show your smile?

source: མོས་པས་ཞི་གནས་རྫིང་དུ་རབ་ཏུ་བཞུགས། །
en: “You have entered with conviction the pool of calm abiding,

source: ཐུགས་རྗེ་ཆུ་བ་བརྩོན་འགྲུས་སྟོབས་ཀྱིས་འཁྲུངས། །
en: Wherein the water of compassion arises by the force of endeavor,

source: དྲན་པས་ཁ་བྱེ་ཡོན་ཏན་དྲི་ཞིམ་ལྡན། །
en: And possesses the sweet fragrance of the blossom of mindfulness—

source: བདེ་གཤེགས་པད་མ་ཅི་སླད་འཛུམ་པ་མཛད། །
en: For what reason, Sublime Lotus, do you show your smile? “Your wisdom is a butter lamp that dispels the darkness.

source: དྲན་པ་སྣོད་བཟང་ཞི་གནས་མར་ལགས་ཏེ། །
en: Mindfulness is its fine holder; calm abiding is the ghee;

source: སྙིང་པོ་ཐུགས་རྗེ་དྲི་མ་གསུམ་སེལ་མཛད། །ཤེས་རབ་མར་མེས་མུན་པ་སེལ་མཛད་པ། །
en: Its wick is compassion by which it removes the three stains—

source: བདེ་གཤེགས་མར་མེ་ཅི་སླད་འཛུམ་པ་མཛད། །
en: For what reason, Sublime Lamp, do you show your smile?

source: དཀྱིལ་འཁོར་ཐུགས་རྗེ་ལྷག་མཐོང་འོད་ལྡན་པ། །
en: “With compassion for the world, the light of your deep insight

source: རབ་རིབ་སེལ་བ་སྲིད་པ་སྐམ་མཛད་པ། །
en: Removes defects from our eyes and extinguishes our craving.

source: འགྲོ་བ་རྒྱས་མཛད་མིག་ནི་སྤྱོད་མཛད་པ། །
en: You cleanse our world and you refine our eyes—

source: བདེ་གཤེགས་ཉི་མ་ཅི་སླད་འཛུམ་པ་མཛད། །
en: For what reason, Sublime Sun, do you show your smile?

source: ཁྱོད་ནི་འགྲོ་བའི་བསམ་པ་རབ་ཏུ་མཁྱེན། །
en: “You know the motivations of those in the world,

source: ཁྱོད་ནི་ལྷར་བཅས་འགྲོ་ནའང་ལྷང་ངེ་བ། །
en: Together with its gods, which you illuminate.

source: དྲང་སྲོང་ཆེན་པོའི་ཞལ་དུ་འཁོར་རྣམས་ལྟ། །
en: The assembly is looking at you to say

source: མི་མཆོག་ཅི་སླད་འདིར་ནི་འཛུམ་པ་མཛད། །
en: Why you have displayed your smile.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཞི་བའི་བློ་གྲོས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་འདི་ནི་རྡོ་རྗེ་ཐོགས་ནས་བསྐལ་པ་བཟང་པོ་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ལ་མཆོད་པ་བྱེད་པར་འགྱུར།
en: When this was said, the Blessed One spoke to the bodhisattva of great courage, Śāntamati: “While holding up this vajra, Vajrapāṇi, Lord of the Guhyakas, will worship all the realized ones of this Fortunate Eon, Śāntamati.

source: དམ་པའི་ཆོས་ཀྱང་ཡོངས་སུ་འཛིན་པར་འགྱུར། དེ་བཞིན་གཤེགས་པའི་གསང་བ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་རྒྱས་པར་བྱེད་པར་འགྱུར། སེམས་ཅན་ཚད་མེད་པ་དག་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ། །
en: He will take hold of the true Dharma, he will propagate this teaching of the Dharma on the secret of the realized ones, and he will make immeasurable beings ready for awakening.

source: དེ་བསྐལ་པ་བཟང་པོ་དེ་འདས་ནས་དེ་བཞིན་གཤེགས་པ་མོས་པའི་བར་གྱི་དམ་པའི་ཆོས་ནུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: “When the Fortunate Eon has ended and the true Dharma of the realized one, Roca, has disappeared, he will be born in the buddha domain of the realized one Akṣobhya.

source: དེ་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་དེར་སྐྱེས་ནས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་དེས་ཕྱག་རྒྱ་བརྒྱ་རྩ་བརྒྱད་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་བསྟན་པས་འཛིན་པར་འགྱུར། དོན་གྱི་ཚུལ་ལ་ཡང་འཇུག་པར་འགྱུར། དེ་བཞིན་ཉིད་དུ་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་རོ། །
en: Taking birth in that Abhiratī world along with the realized one Akṣobhya, he will then maintain the teaching of the bodhisattvas on the one hundred and eight seals, go farther down the path to the goal, and become accomplished in understanding the way things are.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་མཉེས་པར་བྱེད་པར་འགྱུར།
en: In that way, he will encounter immeasurable, incalculable realized ones in the future.

source: བསྟི་སྟང་དུ་བྱེད་པར་འགྱུར། བླ་མར་བྱེད་པར་འགྱུར། །རིམ་གྲོ་བྱེད་པར་འགྱུར། མཆོད་པ་བྱེད་པར་འགྱུར། དེ་དག་གི་གནན་ཚངས་པར་སྤྱོད་པར་འགྱུར།
en: He will serve them, respect them, honor them, worship them, and he will lead the holy life in their presence.

source: དམ་པའི་ཆོས་ཀྱང་སྲུང་བར་འགྱུར། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ་དག་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ། །
en: He will safeguard the true Dharma and make immeasurable hundreds of thousands of millions and billions of beings ready for perfect awakening.

source: དེ་དེའི་འོག་ཏུ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། བསྐལ་པ་རྣམ་པར་སྦྱོང་བ་ཞེས་བྱ་བ་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ནས་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ།
en: “Finally, after traveling through more eons than there are grains of sand in the Ganges River, he will bring to completion the constitutive factors of awakening and awaken to unsurpassable, perfect, and complete awakening.

source: འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྡོ་རྗེས་རྣམ་པར་གནོན་པ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: He will appear as a realized one, a worthy one, a perfectly awakened one, one perfected in knowledge and conduct, a sublime one, a knower of the world, an unsurpassable trainer of those ready to be trained, a teacher of gods and humans, a blessed buddha known as Vajravikrāmin in the world called Samantapariśuddhā, and this will occur during the era called Viśodhana.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེས་རྣམ་པར་གནོན་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ནས་ཡོངས་སུ་དག་པ་དེ་ནི་འབྱོར་པ་དང་། རྒྱས་པ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་བ་དང་། ལྷ་དང་མི་མང་པོས་གང་བ་དང་། བྱང་ཆུབ་སེམས་དཔས་གང་བར་འགྱུར་རོ། །
en: “Moreover, noble son, Samantapariśuddhā, which will be the buddha domain of the blessed realized one Vajravikrāmin, will be wealthy, expansive, bountiful, pleasant, well populated with many gods and human beings, and packed with bodhisattvas.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་རིན་པོ་ཆེ་སྣ་བདུན་འདི་ལྟ་སྟེ། གསེར་དང་། དངུལ་དང་། བཻ་དཱུརྱ་དང་། ཤེལ་དང་།
en: This buddha domain will be adorned with the seven precious substances: gold, silver, lapis lazuli, quartz, agate, emerald, and red pearl.
